# Домашние задания

# 1

duration = int(input('Введите количество секунд: ')) # вводим любой число

# преобразуем секунды в дни, часы и минуты
d = int(duration / 86400)
h = int((duration % 86400) /  3600)
m = int((duration % 3600) /  60)
s = int(duration % 60)

#выводим результат
print(d , 'дн' , h , 'час', m , 'мин', s , 'сек')

# *

#вычисляем остаток суток
d1 = 24 - h
h1 = 60  - m
m1 = 60 - s

#вычисляем остаток часа
h2 = 60 - m
m2 = 60 - s

#вычисляем остаток минуты
m3 = 60 - s

#выводим результат
print("до минуты: ", m3, "сек; до часа: ", h2, "мин ", m2, "сек; до суток: ", d1, "час ", h1, "мин ", m1, "сек")