# 3

# отгруппируем числа для склонения слово "процент"
declination1 = [1, 21, 31, 41, 51, 61, 71, 81, 91]   # процент
declination2 = [2, 3, 4, 22, 23, 24, 32, 33, 34, 42, 43, 44, 52, 53, 54,  # процента
                62, 63, 64, 72, 73, 74, 82, 83, 84, 92, 93, 94]
declination3 = [5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 25, 26, 27,
                28, 29, 30, 35, 36, 37, 38, 39, 40, 45, 46, 47, 48, 49, 50, 55, 56, 57,
                58, 59, 60, 65, 66, 67, 68, 69, 70, 75, 76, 77, 78, 79, 80, 85, 86, 87,
                88, 89, 90, 95, 96, 97, 98, 99, 100]   # процентов

# делаем интервал от 1 до 100 и сразу выводим результат
for i in range(1, 101):
    if i in declination1:
        print(i, 'процент')
    elif i in declination2:
        print(i, 'процента')
    elif i in declination3:
        print(i, 'процентов')

